# SQL Cheat Sheet: Inner Join

- An Inner join only includes records for which the key(values) is in both tables. SEE ONENOTE

## 0. DATABASE TABLES USED

In [23]:
%reload_ext sql


%sql postgresql://localhost/leaders

'Connected: @leaders'

In [29]:
%%sql

SELECT * FROM prime_ministers;

   postgresql://localhost/countries
 * postgresql://localhost/leaders
10 rows affected.

[('Egypt', 'Africa', 'Sherif Ismail'),
 ('Portugal', 'Europe', 'Antonio Costa'),
 ('Vietnam', 'Asia', 'Nguyen Xuan Phuc'),
 ('Haiti', 'North America', 'Jack Guy Lafontant'),
 ('India', 'Asia', 'Narendra Modi'),
 ('Australia', 'Oceania', 'Malcolm Turnbull'),
 ('Norway', 'Europe', 'Erna Solberg'),
 ('Brunei', 'Asia', 'Hassanal Bolkiah'),
 ('Oman', 'Asia', 'Qaboos bin Said al Said'),
 ('Spain', 'Europe', 'Mariano Rajoy')]

In [28]:
%%sql

SELECT * FROM presidents;

   postgresql://localhost/countries
 * postgresql://localhost/leaders
7 rows affected.

[('Egypt', 'Africa', 'Abdel Fattah el-Sisi'),
 ('Portugal', 'Europe', 'Marcelo Rebelo de Sousa'),
 ('Haiti', 'North America', 'Jovenel Moise'),
 ('Uruguay', 'South America', 'Jose Mujica'),
 ('Liberia', 'Africa', 'Ellen Johnson Sirleaf'),
 ('Chile', 'South America', 'Michelle Bachelet'),
 ('Vietnam', 'Asia', 'Tran Dai Quang')]

___

## 2. INNER JOIN

- ### 2.1. EXAMPLE 1
 - ON p1.country = p2.country will match them up based on the country column
 - i.e. wehere both tables have the same value for country

In [34]:
%%sql
SELECT p1.country, p1.continent, president, prime_minister
FROM presidents AS p1
    INNER JOIN prime_ministers AS p2
        ON p1.country = p2.country;

   postgresql://localhost/countries
 * postgresql://localhost/leaders
4 rows affected.

[('Egypt', 'Africa', 'Abdel Fattah el-Sisi', 'Sherif Ismail'),
 ('Portugal', 'Europe', 'Marcelo Rebelo de Sousa', 'Antonio Costa'),
 ('Haiti', 'North America', 'Jovenel Moise', 'Jack Guy Lafontant'),
 ('Vietnam', 'Asia', 'Tran Dai Quang', 'Nguyen Xuan Phuc')]

___

- ### 2.2. EXAMPLE 2
- Connect to the countries DB

In [35]:
%sql postgresql://localhost/countries

'Connected: @countries'

### Cities Table

In [36]:
%%sql
SELECT * FROM cities LIMIT 1;

 * postgresql://localhost/countries
   postgresql://localhost/leaders
1 rows affected.

[('Abidjan', 'CIV', 4765000.0, None, 4765000.0)]

### Countries Table

In [7]:
%%sql
SELECT * FROM countries LIMIT 1;

 * postgresql://localhost/countries
   postgresql://localhost/leaders
1 rows affected.

[('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', 652090.0, 1919, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Kabul', 69.1761, 34.5228)]

___

- Join the cities table to the countries table, keep only the name of the city, the name of the country, and the name of the region the country resides in.

In [8]:
%%sql
SELECT cities.name AS city, countries.name AS country, countries.region
FROM cities
  INNER JOIN countries
    ON cities.country_code = countries.code LIMIT 2;

 * postgresql://localhost/countries
   postgresql://localhost/leaders
2 rows affected.

[('Abidjan', "Cote d'Ivoire", 'Western Africa'),
 ('Abu Dhabi', 'United Arab Emirates', 'Middle East')]

___

### 2.3.  EXAMPLE 3
- Join the tables countries (left) and economies (right) aliasing countries AS c and economies AS e.

### Economies Table

In [37]:
%%sql
SELECT * FROM economies LIMIT 2;

 * postgresql://localhost/countries
   postgresql://localhost/leaders
2 rows affected.

[(1, 'AFG', 2010, 'Low income', 539.667, 37.133, 2.179, 30.402, None, 46.394, 24.381),
 (2, 'AFG', 2015, 'Low income', 615.091, 21.466, -1.549, 18.602, None, -49.11, -7.294)]

- Join countries to economies

In [10]:
%%sql
SELECT c.code AS country_code, name, year, inflation_rate
FROM countries AS c
    INNER JOIN economies as e
        ON c.code = e.code LIMIT 3;

 * postgresql://localhost/countries
   postgresql://localhost/leaders
3 rows affected.

[('AFG', 'Afghanistan', 2010, 2.179),
 ('AFG', 'Afghanistan', 2015, -1.549),
 ('AGO', 'Angola', 2010, 14.48)]

___

### 2.4 EXAMPLE 4: Join 3 Tables

## Populations Table

In [38]:
%%sql
SELECT * FROM populations LIMIT 5;

 * postgresql://localhost/countries
   postgresql://localhost/leaders
5 rows affected.

[(20, 'ABW', 2010, 1.704, 74.95354, 101597.0),
 (19, 'ABW', 2015, 1.647, 75.573586, 103889.0),
 (2, 'AFG', 2010, 5.746, 58.97083, 27962208.0),
 (1, 'AFG', 2015, 4.653, 60.71717, 32526562.0),
 (12, 'AGO', 2010, 6.416, 50.65417, 21219954.0)]

- JOin the countries table to the populaitons and economies table

In [41]:
%%sql
SELECT c.code, name, region, p.year, fertility_rate, unemployment_rate
FROM countries AS c
    INNER JOIN populations AS p
        ON c.code = p.country_code
    INNER JOIN economies AS e
        ON c.code = e.code
        AND p.year = e.year
        LIMIT 5;

 * postgresql://localhost/countries
   postgresql://localhost/leaders
5 rows affected.

[('AFG', 'Afghanistan', 'Southern and Central Asia', 2010, 5.746, None),
 ('AFG', 'Afghanistan', 'Southern and Central Asia', 2015, 4.653, None),
 ('AGO', 'Angola', 'Central Africa', 2010, 6.416, None),
 ('AGO', 'Angola', 'Central Africa', 2015, 5.996, None),
 ('ALB', 'Albania', 'Southern Europe', 2010, 1.663, 14.0)]

___

___

## 3. INNER JOIN via USING
- If both tables have a column with the same name you can use USING(col_name) instead of ON col_name = ...

### Language Table

In [13]:
%%sql
SELECT * FROM languages
LIMIT 3;

 * postgresql://localhost/countries
   postgresql://localhost/leaders
3 rows affected.

[(1, 'AFG', 'Dari', 50.0, True),
 (2, 'AFG', 'Pashto', 35.0, True),
 (3, 'AFG', 'Turkic', 11.0, False)]

- Join countries to languages
 - USING(name) would select countries whose name are akso the language

In [14]:
%%sql
SELECT c.name AS country, continent, l.name AS language, Official
FROM countries AS c
    INNER JOIN languages as l
        USING(code)
        LIMIT 5;

 * postgresql://localhost/countries
   postgresql://localhost/leaders
5 rows affected.

[('Afghanistan', 'Asia', 'Dari', True),
 ('Afghanistan', 'Asia', 'Pashto', True),
 ('Afghanistan', 'Asia', 'Turkic', False),
 ('Afghanistan', 'Asia', 'Other', False),
 ('Albania', 'Europe', 'Albanian', True)]

___

---

## 4. SELF JOINS
 - COmpare values in a field to other values of the same field in the same table
 - Wats he point? makes no sense to me why you would do this.

In [44]:
%sql postgresql://localhost/leaders

'Connected: @leaders'

In [48]:
%%sql
SELECT p1.country As country1, p2.country AS country2, p1.continent
FROM prime_ministers AS p1
    INNER JOIN prime_ministers AS p2
        ON p1.continent = p2.continent 
        AND p1.country <> p2.country
LIMIT 6;

   postgresql://localhost/countries
 * postgresql://localhost/leaders
6 rows affected.

[('Portugal', 'Norway', 'Europe'),
 ('Portugal', 'Spain', 'Europe'),
 ('Vietnam', 'India', 'Asia'),
 ('Vietnam', 'Brunei', 'Asia'),
 ('Vietnam', 'Oman', 'Asia'),
 ('India', 'Vietnam', 'Asia')]

___

In this exercise, you'll use the populations table to perform a self-join to calculate the percentage increase in population from 2010 to 2015 for each country code!

In [49]:
%sql postgresql://localhost/countries

'Connected: @countries'

In [50]:
%sql SELECT * FROM populations LIMIT 2

 * postgresql://localhost/countries
   postgresql://localhost/leaders
2 rows affected.

[(20, 'ABW', 2010, 1.704, 74.95354, 101597.0),
 (19, 'ABW', 2015, 1.647, 75.573586, 103889.0)]

 - If p1.year = p2.year - 5 then SQl will only match when the value of p1.year is -5 the value of p2.year (2010 & 2015)

In [57]:
%%sql
SELECT p1.country_code, 
       p1.size AS size2010, 
       p2.size AS size2015, 
       ((p2.size - p1.size)/p1.size  * 100.0) AS growth_perc
FROM populations as p1
    INNER JOIN populations AS p2
        ON p1.country_code = p2.country_code
        AND p2.year = p1.year + 5
        LIMIT 5;

 * postgresql://localhost/countries
   postgresql://localhost/leaders
5 rows affected.

[('ABW', 101597.0, 103889.0, 2.2559721022844315),
 ('AFG', 27962208.0, 32526562.0, 16.32329672574997),
 ('AGO', 21219954.0, 25021974.0, 17.917191982269287),
 ('ALB', 2913021.0, 2889167.0, -0.818874966353178),
 ('AND', 84419.0, 70473.0, -16.519977152347565)]